[
  {
    "logo_url": "https://zerodha.com/z-connect/wp-content/uploads/2024/06/hyundai-ipo-300x300.jpg",
    "link": "https://zerodha.com//ipo/381489/hyundai-motor-india",
    "symbol": "HYUNDAI",
    "name": "Hyundai Motor India",
    "ipo_start_date": null,
    "ipo_end_date": null,
    "listing_date": null,
    "min_price": null,
    "max_price": null,
    "details": {
      "ipo_start_date": null,
      "ipo_end_date": null,
      "listing_date": null,
      "min_price": null,
      "max_price": null,
      "issue_size": null,
      "lot_size": null,
      "schedule": [],
      "about": "The Hyundai IPO could be the largest in Indian history! /n Hyundai Motor India, a subsidiary of the Korea-based Hyundai Group, was established in 1996. The company specializes in manufacturing and selling a wide range of four-wheeler passenger vehicles, including sedans, hatchbacks, SUVs, and electric vehicles (EVs). Additionally, Hyundai produces key automotive parts such as transmissions and engines. /n Currently, Hyundai’s lineup includes 13 models, ranging from sedans and hatchbacks to SUVs. In FY 2024, Hyundai captured approximately 15% of the domestic car market, securing the second position behind Maruti Suzuki. As of December 31, 2023, Hyundai Motor India boasted 1,366 sales outlets and 1,550 service centres across various cities and towns in India. This marked a significant expansion from March 31, 2021, when the company operated 1,167 sales outlets and 1,307 service centres. /n 4 million! That’s how many cars Indians bought in 2023. In fact, we’re the third-biggest car market globally, trailing only China and the US. With electric vehicles gaining popularity, experts predict India will have 2.5 million EVs on the roads by 2025, making us the third-largest EV market as well. Automakers are closely watching these developments and are eager to jump on this trend. /n Take Hyundai India, for instance. Despite being a subsidiary of South Korea’s Hyundai Motor Company, it has a rich history in the country. Hyundai India became a household name by manufacturing locally, overcoming early competition, and innovating for the Indian market. Now, they plan to take it further by raising a whopping ₹25,000 crores through an IPO, potentially breaking previous IPO records held by LIC and PayTM. /n But wait… If Hyundai is a foreign brand, why pursue an IPO in the Indian market, you ask?",
      "min_investment": null,
      "strengths": [
        "World’s third-largest auto Original Equipment Manufacturer (OEM) by passenger vehicle sales in 2023.",
        "Sold nearly 12 million passenger vehicles in India and through exports from 1998 to March 31, 2024.",
        "Second-largest auto Original Equipment Manufacturer (OEM) in the Indian market since 2009 (domestic sales volumes).",
        "India’s largest exporter of passenger vehicles from 2005 to the first 11 months of 2024, with the highest cumulative exports for this period."
      ],
      "risks": [
        "Kia Corporation and Kia India Pvt Ltd owned by Hyundai also operate in a similar domain, which could lead to conflicts of interest.",
        "Centralized at the Chennai plant; disruptions, including at the upcoming Talegaon plant (operational in H2 Fiscal 2026), could impact operations and financial health.",
        "Significant revenue depends on SUV sales; declines in demand or production issues could negatively affect operations.",
        "Operations are subject to seasonal fluctuations, which impact sales and financial performance. Demand typically peaks in January-March and during the festive season, with slowdowns in April-July and December.",
        "Changes in tax laws could negatively affect business prospects, financial standing, operational outcomes, and cash flows."
      ]
    }
  }
]